goal_app/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params(params))
        if @user && @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "raph@raph.com"], ["password_digest", "$2a$12$g2PdKQCEDNlTdR.txFQqLuv2kiHnI8.fk2v3LftuqhMof2R2DY.7C"], ["session_token", "dwl-dRqStOzkDLQpQ85SwQ"]]

    def destroy
        @user = User.find(params[:id])
        if @user
            @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 95]]